@benbuchanan the issue is still there with provider `1.51.0-beta0`

This is the apply output

```
# module.sdnlb_vpe_object.ibm_cm_object.vpe_catalog_object[0] will be created
  + resource "ibm_cm_object" "vpe_catalog_object" {
      + catalog_id        = (known after apply)
      + catalog_name      = (known after apply)
      + created           = (known after apply)
      + crn               = (known after apply)
      + data              = "\"{\\n      \\\"dns_domain\\\": \\\"test-provider.test.cloud.ibm.com\\\",\\n      \\\"endpoint_type\\\": \\\"api\\\",\\n      \\\"fully_qualified_domain_names\\\": [\\\"test-vb.test-provider.test.cloud.ibm.com\\\"],\\n      \\\"service_crn\\\": \\\"crn:v1:bluemix:public:service:global:::endpoint:test-provider.test.cloud.ibm.com\\\"\\n}\\n\""
      + id                = (known after apply)
      + kind              = "vpe"
      + label             = "provider test vb"
      + name              = "test_provider_vb"
      + object_id         = (known after apply)
      + parent_id         = "eu-gb"
      + publish           = (known after apply)
      + rev               = (known after apply)
      + short_description = "TEST provider Vb"
      + state             = (known after apply)
      + tags              = [
          + "test-provider-vb",
        ]
      + updated           = (known after apply)
      + url               = (known after apply)
    }
```

this is the plan immediately after the previous apply

```
# module.sdnlb_vpe_object.ibm_cm_object.vpe_catalog_object[0] will be updated in-place
  ~ resource "ibm_cm_object" "vpe_catalog_object" {
      ~ data              = jsonencode(
          ~ {
              - dns_domain                   = "test-provider.test.cloud.ibm.com"
              - endpoint_type                = "api"
              - fully_qualified_domain_names = [
                  - "test-vb.test-provider.test.cloud.ibm.com",
                ]
              - service_crn                  = "crn:v1:bluemix:public:service:global:::endpoint:test-provider.test.cloud.ibm.com"
            } -> jsonencode(
                {
                  + dns_domain                   = "test-provider.test.cloud.ibm.com"
                  + endpoint_type                = "api"
                  + fully_qualified_domain_names = [
                      + "test-vb.test-provider.test.cloud.ibm.com",
                    ]
                  + service_crn                  = "crn:v1:bluemix:public:service:global:::endpoint:test-provider.test.cloud.ibm.com"
                }
            )
        )
        id                = "bfa68aac-f771-433e-adab-5e6b01cb58ad-test_provider_vb"
        name              = "test_provider_vb"
      ~ tags              = [
            "test-provider-vb",
          - "eu-gb",
          - "svc:service",
          - "fqdn:test-vb.test-provider.test.cloud.ibm.com",
        ]
        # (14 unchanged attributes hidden)
    }
```

confirmed by terraform show, which shows tags auto generated into the tf object

```
# module.sdnlb_vpe_object.ibm_cm_object.vpe_catalog_object[0]:
resource "ibm_cm_object" "vpe_catalog_object" {
    catalog_id        = "bfa68aac-f771-433e-adab-5e6b01cb58ad"
    catalog_name      = "provider test vb-cp-internal-vpes"
    created           = "2023-02-27T17:11:21.362Z"
    crn               = "crn:v1:bluemix:public:globalcatalog-collection:global:a/abac0df06b644a9cabc6e44f55b3880e:bfa68aac-f771-433e-adab-5e6b01cb58ad:vpe:bfa68aac-f771-433e-adab-5e6b01cb58ad-test_provider_vb"
    data              = jsonencode(
        {
            dns_domain                   = "test-provider.test.cloud.ibm.com"
            endpoint_type                = "api"
            fully_qualified_domain_names = [
                "test-vb.test-provider.test.cloud.ibm.com",
            ]
            service_crn                  = "crn:v1:bluemix:public:service:global:::endpoint:test-provider.test.cloud.ibm.com"
        }
    )
    id                = "bfa68aac-f771-433e-adab-5e6b01cb58ad-test_provider_vb"
    kind              = "vpe"
    label             = "provider test vb"
    name              = "test_provider_vb"
    object_id         = "bfa68aac-f771-433e-adab-5e6b01cb58ad-test_provider_vb"
    parent_id         = "eu-gb"
    publish           = [
        {
            ibm_approved              = null
            permit_ibm_public_publish = null
            portal_approval_record    = null
            portal_url                = null
            public_approved           = null
        },
    ]
    rev               = "2-ed90c9099ddf55ce06dd598be2dc3263"
    short_description = "TEST provider Vb"
    state             = [
        {
            current           = "new"
            current_entered   = "2023-02-27T17:11:21.119Z"
            pending           = ""
            pending_requested = ""
            previous          = ""
        },
    ]
    tags              = [
        "test-provider-vb",
        "eu-gb",
        "svc:service",
        "fqdn:test-vb.test-provider.test.cloud.ibm.com",
    ]
    updated           = "2023-02-27T17:11:22.170Z"
    url               = "https://cm.globalcatalog.cloud.ibm.com/api/v1-beta/catalogs/bfa68aac-f771-433e-adab-5e6b01cb58ad/objects/bfa68aac-f771-433e-adab-5e6b01cb58ad-test_provider_vb"
}
```